//-----------------------------------------------------------------—
// ИКТИБ ЮФУ
// Kафедра МОП ЭВМ(09.03.04)
// Структуры и алгоритмы обработки данных
// Задание: Синие и красные
// Исполнитель: Карманов Сергей Сергеевич (КТбо1-8)
// 19.05.2023
//-------------------------------------------------------------------

#include <iostream>
#include <string>

using namespace std;

int main() {
    string s;
    unsigned int count = 0;
    
    cin >> s;

    for(size_t i = s.find('R'); i < s.size(); i++)
        if(s[i] == 'B') {
            s.erase(i, 1);
            count++;
            i--;
        }

    cout << s << endl << count;
    return 0;
}